In [1]:
from IPython.display import HTML

In [2]:
HTML('<iframe src=http://stanford.edu/~mwaakom/software/seaborn/index.html width=700 height=350></iframe>')

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
sns.set_palette('deep', desat=.6)

In [6]:
sns.set_context(rc={"figure.figsize": (8,4)})

# Load data sets

In [7]:
titanic = pd.read_csv('data/titanic.csv')

In [8]:
mlb = pd.read_csv('data/mlbsalaries.csv')

In [9]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
mlb.head()

   Year           Player   Salary           Position                Team
0  1988        Mike Witt  1400000            Pitcher  Los Angeles Angels
1  1988  George Hendrick   989333         Outfielder  Los Angeles Angels
2  1988      Chili Davis   950000         Outfielder  Los Angeles Angels
3  1988    Brian Downing   900000  Designated Hitter  Los Angeles Angels
4  1988        Bob Boone   883000            Catcher  Los Angeles Angels

In [16]:
titanic.Age.dropna().hist()

In [18]:
plt.hist(titanic.Age.dropna(), bins=25)

(array([ 30.,  17.,  15.,   9.,  29.,  64.,  67.,  70.,  83.,  62.,  51.,
         40.,  35.,  27.,  35.,  23.,  15.,   9.,  11.,  11.,   4.,   2.,
          3.,   1.,   1.]),
 array([  0.42  ,   3.6032,   6.7864,   9.9696,  13.1528,  16.336 ,
         19.5192,  22.7024,  25.8856,  29.0688,  32.252 ,  35.4352,
         38.6184,  41.8016,  44.9848,  48.168 ,  51.3512,  54.5344,
         57.7176,  60.9008,  64.084 ,  67.2672,  70.4504,  73.6336,
         76.8168,  80.    ]),
 <a list of 25 Patch objects>)

In [19]:
sns.boxplot(titanic.Age)